DataProcessors/ОбучениеПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ОбучениеПоОхранеТруда</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОбновлениеПериодическогоОбученияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОбновлениеПериодическогоОбученияПоОхранеТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БудущиеСобытияОбучениеПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>БудущиеСобытияОбучениеПоОхранеТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РезультатыПроверкиЗнанияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыПроверкиЗнанияПоОхранеТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Удовлетворительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неудовлетворительно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбучениеСотрудниковОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбучениеСотрудниковОхранеТруда</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбученияСотрудниковПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Comment>Внутренняя/внешняя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Comment>АПК:58 различия имени и синонима оправданы. Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяДатаПроверкиЗнания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПроверкаЗнанияТребованийОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПроверкаЗнанияТребованийОхраныТруда</Name>
			<BasedOn>
				<xr:Item>Document.ОбучениеСотрудниковОхранеТруда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПроверкиЗнанияТребованийОхраныТрудаСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбученияСотрудниковПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Comment>Внутренняя/внешняя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбучениеСотрудников</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Comment>АПК:58 различия имени и синонима оправданы. Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротоколаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиЗнания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроверкиЗнанияПоОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ОбучениеПоОхранеТруда/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры["Организация"];
	КонецЕсли;
	
	ЗаполнитьНачальныеЗначения();
	
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	УстановитьПараметрТекущаяДата(ЭтотОбъект);
	УстановитьОтборПоОрганизации(ЭтотОбъект);
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	
	УстановитьОтборТолькоБлижайшие(ЭтотОбъект, ПоказыватьТолькоБлижайшие);
	ДоработатьПользовательскиеНастройкиСпискаРабочихМест();
	
	УстановитьУсловноеОформление();
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПроверитьНаличиеНеактуальныхЗаписейПериодическихОбучений", 60);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбновитьПериодическиеОбучения = Ложь;
	Если ИмяСобытия = "Запись_НазначениеРабочихМестСотрудникам"
	 Или ИмяСобытия = "Запись_ПриемНаРаботу"
	 Или ИмяСобытия = "Запись_ПриемНаРаботуСписком"
	 Или ИмяСобытия = "Запись_КадровыйПеревод"
	 Или ИмяСобытия = "Запись_КадровыйПереводСписком"
	 Или ИмяСобытия = "Запись_ОбучениеСотрудниковОхранеТруда"
	 Или ИмяСобытия = "Запись_ПроверкаЗнанияТребованийОхраныТруда" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОбучений();
		ОбновитьПериодическиеОбучения = Истина;
	ИначеЕсли ИмяСобытия = "Запись_РабочиеМестаОхраныТруда"
		Или ИмяСобытия = "Запись_ПрограммыОбученияСотрудниковПоОхранеТруда" Тогда
		
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОбучений();
		ОбновитьПериодическиеОбучения = Истина;
		Элементы.РабочиеМеста.Обновить();
	КонецЕсли;
	
	Если ОбновитьПериодическиеОбучения И Элементы.СотрудникиСтраница.Видимость Тогда
		Элементы.ПрограммыОбучения.Обновить();
		Элементы.ПериодическиеОбучения.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьОтборПоОрганизации(ЭтотОбъект);
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	ОрганизацияПриИзмененииНаСервере();
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоБлижайшиеПриИзменении(Элемент)
	УстановитьОтборТолькоБлижайшие(ЭтотОбъект, ПоказыватьТолькоБлижайшие);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДанныхНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьОбновлениеПериодическихОбучений();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрограммыОбучения

&НаКлиенте
Процедура ПрограммыОбученияПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПриАктивизацииСтрокиПрограммыОбученияНаКлиенте", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПериодическиеОбучения

&НаКлиенте
Процедура ПериодическиеОбученияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПериодическиеОбучения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьСотрудника(ТекущиеДанные, Поле);
	ОткрытьРабочееМесто(ТекущиеДанные, Поле);
	ОткрытьОбучение(ТекущиеДанные, Поле);
	ОткрытьПроверку(ТекущиеДанные, Поле);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПериодическиеОбученияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	ОформитьСтрокиПериодическихОбучений(ИмяЭлемента, Настройки, Строки);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРабочиеМеста

&НаКлиенте
Процедура РабочиеМестаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РабочиеМеста.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя <> "РабочиеМестаНаименование" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные["Ссылка"]);
	
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОбучение(Команда)
	НачатьФормированиеОбучения();
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПроверкуЗнания(Команда)
	НачатьВводПроверкиЗнания();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеОбучения

&НаКлиенте
Процедура НачатьФормированиеОбучения()
	
	Если Элементы.ПериодическиеОбучения.ВыделенныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ПериодическиеОбучения.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ПериодическиеОбучения.ДанныеСтроки(ВыделеннаяСтрока);
		Если ЗначениеЗаполнено(ДанныеСтроки.Обучение) И Не ДанныеСтроки.ПроверкаЗавершена Тогда
			ПоказатьВопросОбучениеСуществует(ДанныеСтроки.Обучение);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	СформироватьНовоеОбучение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОбучениеСуществует(Обучение)
	
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Для сотрудника уже введен документ %1, который пока не проведен.'"), Обучение);
		
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Открыть существующий'"));
	Кнопки.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru = 'Создать новый'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
	ОбработчикОповещения = Новый ОписаниеОповещения("СформироватьНовоеОбучениеПослеВопросаОбучениеСуществует", ЭтотОбъект, Обучение);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНовоеОбучениеПослеВопросаОбучениеСуществует(Результат, Обучение) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Прервать Тогда
		ПоказатьЗначение(, Обучение);
		Возврат;
	КонецЕсли;
	
	СформироватьНовоеОбучение();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СформироватьНовоеОбучение()
	
	ФизическиеЛицаРабочиеМеста = Ждать ФизическиеЛицаРабочиеМеста();
	Если ФизическиеЛицаРабочиеМеста.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	ЗначенияЗаполнения.Вставить("ПрограммаОбучения", ВыбраннаяПрограммаОбучения);
	ЗначенияЗаполнения.Вставить("ФизическиеЛицаРабочиеМеста", ФизическиеЛицаРабочиеМеста);
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ЗначенияЗаполнения.Вставить("Подразделение", Подразделение);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ПараметрыФормы.ЗначенияЗаполнения = ЗначенияЗаполнения;
	
	ОткрытьФорму("Документ.ОбучениеСотрудниковОхранеТруда.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ВводПроверкиЗнания

&НаКлиенте
Процедура НачатьВводПроверкиЗнания()
	
	Если Элементы.ПериодическиеОбучения.ВыделенныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ПериодическиеОбучения.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ПериодическиеОбучения.ДанныеСтроки(ВыделеннаяСтрока);
		Если ЗначениеЗаполнено(ДанныеСтроки.Проверка) И Не ДанныеСтроки.ПроверкаЗавершена Тогда
			Если Не ДанныеСтроки.ПроверкаЗавершена Тогда
				ПоказатьВопросПроверкаЗнанияСуществует(ДанныеСтроки.Проверка);
				Возврат;
			КонецЕсли;
			ВызватьИсключение НСтр("ru = 'Для выбранной строки проверка знания уже завершена.
				|Проверку знания можно ввести только при наличии программы, по которой нет результатов обучения.'");
		КонецЕсли;
	КонецЦикла;
	
	ВвестиНовуюПроверкуЗнания();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьВопросПроверкаЗнанияСуществует(Проверка)
	
	ТекстВопроса = СтрШаблон( НСтр("ru = 'Для сотрудника уже введен документ %1, который пока не проведен.'"), Проверка);
		
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Открыть существующий'"));
	Кнопки.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru = 'Создать новый'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
	ОбработчикОповещения = Новый ОписаниеОповещения("ВвестиНовуюПроверкуЗнанияПослеВопросаПроверкаЗнанияСуществует", ЭтотОбъект, Проверка);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовуюПроверкуЗнанияПослеВопросаПроверкаЗнанияСуществует(Результат, Проверка) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Прервать Тогда
		ПоказатьЗначение(, Проверка);
		Возврат;
	КонецЕсли;
	
	ВвестиНовуюПроверкуЗнания();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВвестиНовуюПроверкуЗнания()
	
	ФизическиеЛицаРабочиеМеста = Ждать ФизическиеЛицаРабочиеМеста();
	Если ФизическиеЛицаРабочиеМеста.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура(
		"Организация,
		|ПрограммаОбучения,
		|ФизическиеЛицаРабочиеМеста");
	ЗначенияЗаполнения.Организация = Организация;
	ЗначенияЗаполнения.ПрограммаОбучения = ВыбраннаяПрограммаОбучения;
	ЗначенияЗаполнения.ФизическиеЛицаРабочиеМеста = ФизическиеЛицаРабочиеМеста;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ЗначенияЗаполнения.Вставить("Подразделение", Подразделение);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ПараметрыФормы.ЗначенияЗаполнения = ЗначенияЗаполнения;
	
	ОткрытьФорму("Документ.ПроверкаЗнанияТребованийОхраныТруда.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПроверитьНаличиеНеактуальныхЗаписейПериодическихОбучений()
	
	БылиНеАктуальныеЗаписи = Элементы.ОбновлениеДанныхГруппа.Видимость;
	
	ОрганизацияПриИзмененииНаСервере();
	
	Если БылиНеАктуальныеЗаписи И Не ЕстьНеактуальныеЗаписиПериодическихОбучений(Организация) Тогда
		Элементы.ПрограммыОбучения.Обновить();
		Элементы.ПериодическиеОбучения.Обновить();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьСотрудника(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.Сотрудник Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = СотрудникПоФизическомуЛицу(ТекущиеДанные["ФизическоеЛицо"], ТекущиеДанные["РабочееМесто"], Организация);
	
	ПоказатьЗначение(, Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРабочееМесто(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.РабочееМесто Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = ТекущиеДанные.РабочееМесто;
	
	Если Не ЗначениеЗаполнено(ПараметрыФормы.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбучение(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.Обучение Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Обучение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроверку(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.Проверка Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Проверка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникПоФизическомуЛицу(ФизическоеЛицо, РабочееМесто, Организация)
	
	Возврат ОхранаТруда.СотрудникПоФизическомуЛицу(ФизическоеЛицо, РабочееМесто, Организация);
	
КонецФункции

&НаКлиенте
Процедура НачатьОбновлениеПериодическихОбучений()
	
	ДлительнаяОперация = ОбновитьПериодическиеОбученияНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновление сведений о периодических обучениях по охране труда'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеПериодическихОбученийЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеПериодическихОбученийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеНеактуальныхЗаписейПериодическихОбучений();
	
КонецПроцедуры 

&НаСервере
Функция ОбновитьПериодическиеОбученияНаСервере()
	
	ПараметрыПроцедуры = Новый Структура("Организация");
	ПараметрыПроцедуры.Организация = Организация;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания =
		НСтр("ru = 'Обновление сведений о периодических обучениях по охране труда'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ОбучениеПоОхранеТруда.ОбновитьПериодическиеОбученияОрганизацииДлительнаяОперация",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНачальныеЗначения()
	
	ЗначенияДляЗаполнения = Новый Структура;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ЗначенияДляЗаполнения.Вставить("Организация", "Организация");
		ЗначенияДляЗаполнения.Вставить("Подразделение", "Подразделение");
	КонецЕсли;
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
	
	Если Организация.Пустая() Тогда
		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбработкаОбучениеПоОхранеТруда", "Организация");
	КонецЕсли;
	
	Если Подразделение.Пустая() Тогда
		Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбработкаОбучениеПоОхранеТруда", "Подразделение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрПрограммаОбучения(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.ПериодическиеОбучения, "ПрограммаОбучения", Форма.ВыбраннаяПрограммаОбучения);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.РабочиеМеста, "ПрограммаОбучения", Форма.ВыбраннаяПрограммаОбучения);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрТекущаяДата(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.ПрограммыОбучения, "ТекущаяДата", Форма.ТекущаяДата);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.ПериодическиеОбучения, "ТекущаяДата", Форма.ТекущаяДата);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.РабочиеМеста, "ТекущаяДата", Форма.ТекущаяДата);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоОрганизации(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.ПериодическиеОбучения, "Организация", Форма.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.РабочиеМеста, "Организация", Форма.Организация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.ПрограммыОбучения, "Организация", Форма.Организация);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПодразделению(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.РабочиеМеста, "Подразделение", Форма.Подразделение, , , ЗначениеЗаполнено(Форма.Подразделение));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.ПериодическиеОбучения, "Подразделение", Форма.Подразделение, , , ЗначениеЗаполнено(Форма.Подразделение));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.ПрограммыОбучения, "ЕстьПодразделение", ЗначениеЗаполнено(Форма.Подразделение));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.ПрограммыОбучения, "Подразделение", Форма.Подразделение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Есть просроченные обучения.
	ЭлементОформления = ПрограммыОбучения.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "Просрочено", 0, ВидСравненияКомпоновкиДанных.Больше);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаКритичногоСостоянияОхраныТруда);
	
	// Просрочено обучение.
	ЭлементОформления = ПериодическиеОбучения.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "ДатаСледующейПроверкиЗнания", ТекущаяДата, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаКритичногоСостоянияОхраныТруда);
	
	// Однократное обучение.
	ЭлементОформления = ПериодическиеОбучения.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "ДатаСледующейПроверкиЗнания", НачалоДня(ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата()));
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '< Не требуется >'"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаСледующейПроверкиЗнания");
	
	// Неудовлетворительно.
	ЭлементОформления = ПериодическиеОбучения.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "РезультатОбучения", Перечисления.РезультатыПроверкиЗнанияПоОхранеТруда.Неудовлетворительно);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаКритичногоСостоянияОхраныТруда);
	
	// Нет результата.
	ЭлементОформления = ПериодическиеОбучения.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "РезультатОбучения", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЖирныйШрифтБЭД);
	
	// Увольнение раньше следующего обучения.
	ЭлементОформления = ПериодическиеОбучения.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "ДатаУвольнения", , ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "ДатаСледующейПроверкиЗнания", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеАктивнойСтрокиОхраныТруда);
	
	// Увольнение позже следующего обучения.
	ЭлементОформления = ПериодическиеОбучения.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "ДатаУвольнения", "ДатаСледующейПроверкиЗнания", ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '< Не требуется >'"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаСледующейПроверкиЗнания");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОформитьСтрокиПериодическихОбучений(ИмяЭлемента, Настройки, Строки)
	
	Сегодня = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	
	Для Каждого СтрокаСписка Из Строки Цикл
		ДанныеСтроки = СтрокаСписка.Значение.Данные;
		ОформлениеСтроки = СтрокаСписка.Значение.Оформление;
		ОтображатьКартинкуПредупреждение = Ложь;
		ТекстСостояния = Неопределено;
		// До обучения меньше месяца.
		Если ДанныеСтроки.ДатаСледующейПроверкиЗнания > Сегодня И ДанныеСтроки.ДатаСледующейПроверкиЗнания < ДобавитьМесяц(Сегодня, 1) Тогда
			ТекстСостояния = НСтр("ru = 'До обучения меньше месяца'");
		КонецЕсли;
		// Обучение просрочено или не проводилось.
		Если ДанныеСтроки.ДатаСледующейПроверкиЗнания <= Сегодня Тогда
			ТекстСостояния = НСтр("ru = 'Пройти обучение немедленно'");
			ОтображатьКартинкуПредупреждение = Истина;
		КонецЕсли;
		// Проверка знания пройдена неудовлетворительно.
		Если ДанныеСтроки.РезультатОбучения = Перечисления.РезультатыПроверкиЗнанияПоОхранеТруда.Неудовлетворительно Тогда
			ТекстСостояния = НСтр("ru = 'Проверка знания требований охраны труда не пройдена, требуется отстранение от работы'");
			ОтображатьКартинкуПредупреждение = Истина;
		КонецЕсли;
		// В процессе обучения.
		Если ЗначениеЗаполнено(ДанныеСтроки.Обучение) И Не ЗначениеЗаполнено(ДанныеСтроки.РезультатОбучения) Тогда
			ОтображатьКартинкуПредупреждение = Ложь;
			Если ЗначениеЗаполнено(ДанныеСтроки.Проверка) Тогда
				ТекстСостояния = НСтр("ru = 'Документ проверки знания введен, но не проведен'");
			Иначе
				ТекстСостояния = НСтр("ru = 'Обучение пройдено, требуется проверка знания'");
			КонецЕсли;
		КонецЕсли;
		// Уволен раньше следующего обучения
		Если ЗначениеЗаполнено(ДанныеСтроки.ДатаУвольнения) И НЕ ЗначениеЗаполнено(ДанныеСтроки.ДатаСледующейПроверкиЗнания) Тогда
			ОтображатьКартинкуПредупреждение = Ложь;
			ТекстСостояния = СтрШаблон(НСтр("ru = 'Увольняется с %1'"),
				Формат(ДанныеСтроки.ДатаУвольнения, НСтр("ru='ДФ=''dd.MM.yyyy ""г.""'''")));
		КонецЕсли;
		// Будет уволен позже следующего обучения
		Если ЗначениеЗаполнено(ДанныеСтроки.ДатаУвольнения) И ЗначениеЗаполнено(ДанныеСтроки.ДатаСледующейПроверкиЗнания) Тогда
			ОтображатьКартинкуПредупреждение = Истина;
			ТекстСостояния = СтрШаблон(НСтр("ru = 'Увольняется с %1'"),
				Формат(ДанныеСтроки.ДатаУвольнения, НСтр("ru='ДФ=''dd.MM.yyyy ""г.""'''")));
		КонецЕсли;
		Если Не ОтображатьКартинкуПредупреждение Тогда
			УстановитьЗначениеПараметраОформленияПоля(ОформлениеСтроки, "ПредупреждениеКартинка", "Отображать", Ложь);
		КонецЕсли;
		УстановитьЗначениеПараметраОформленияПоля(ОформлениеСтроки, "СостояниеОбучения", "Текст", ТекстСостояния);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеПараметраОформленияПоля(ОформлениеСтроки, ИмяПоля, Параметр, Значение)
	
	ОформлениеЯчейки = ОформлениеСтроки.Получить(ИмяПоля);
	
	Если ОформлениеЯчейки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОформлениеЯчейки.УстановитьЗначениеПараметра(Параметр, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииСтрокиПрограммыОбученияНаКлиенте()
	
	Если Элементы.ПрограммыОбучения.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрограммаОбучения = Элементы.ПрограммыОбучения.ТекущиеДанные.Ссылка;
	
	Если ПрограммаОбучения = ВыбраннаяПрограммаОбучения Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяПрограммаОбучения = ПрограммаОбучения;
	
	УстановитьПараметрПрограммаОбучения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДоработатьПользовательскиеНастройкиСпискаРабочихМест()
	
	Элементы.РабочиеМеста.СоздатьЭлементыФормыПользовательскихНастроек(Элементы.ПользовательскиеНастройкиРабочихМестГруппа);
	Для Каждого ЭлементНастроек Из Элементы.ПользовательскиеНастройкиРабочихМестГруппа.ПодчиненныеЭлементы Цикл
		Если ЭлементНастроек.Вид = ВидПоляФормы.ПолеФлажка Тогда
			ЭлементНастроек.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборТолькоБлижайшие(Форма, Использование)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.ПериодическиеОбучения, 
		"ДатаСледующейПроверкиЗнания", 
		ДобавитьМесяц(Форма.ТекущаяДата, 1), 
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , 
		Использование);
		
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ВсеПозицииБезОбучения = ВсеПозицииБезОбучения(Организация);
	УстановитьНадписьПояснениеПустогоСпискаПериодическихОбучений(ЭтотОбъект, ВсеПозицииБезОбучения);
	
	ЕстьНеактуальныеЗаписи = ЕстьНеактуальныеЗаписиПериодическихОбучений(Организация);
	УстановитьНадписьОбновитьПериодическиеОбучения(ЭтотОбъект, ЕстьНеактуальныеЗаписи);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьПояснениеПустогоСпискаПериодическихОбучений(Форма, ВсеПозицииБезОбучения)
	
	Форма.Элементы.ПояснениеИспользованияГруппа.Видимость = ВсеПозицииБезОбучения;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьОбновитьПериодическиеОбучения(Форма, ЕстьНеактуальныеЗаписи)
	
	Форма.Элементы.ОбновлениеДанныхГруппа.Видимость = ЕстьНеактуальныеЗаписи;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНеактуальныеЗаписиПериодическихОбучений(Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.ОбновлениеПериодическогоОбученияПоОхранеТруда КАК ОбновлениеОбучений
		|ГДЕ
		|	ОбновлениеОбучений.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.БудущиеСобытияОбучениеПоОхранеТруда КАК БудущиеСобытия
		|ГДЕ
		|	БудущиеСобытия.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И БудущиеСобытия.ДатаСобытия <= &ДатаАктуальности";
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ОбщегоНазначения.ТекущаяДатаПользователя());
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция ВсеПозицииБезОбучения(Организация)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда КАК
		|			ПрограммыОбученияСотрудниковПоОхранеТруда
		|		ПО ВЫБОР
		|			КОГДА ПрограммыОбученияСотрудниковПоОхранеТруда.ПометкаУдаления
		|				ТОГДА ЛОЖЬ
		|			КОГДА ПрограммыОбученияСотрудниковПоОхранеТруда.КонтролироватьПроведение
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.РабочиеМеста КАК
		|			ПрограммыОбученияСотрудниковПоОхранеТрудаРабочиеМеста
		|		ПО ПрограммыОбученияСотрудниковПоОхранеТруда.Ссылка = ПрограммыОбученияСотрудниковПоОхранеТрудаРабочиеМеста.Ссылка
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ПрограммыОбученияСотрудниковПоОхранеТруда.ИспользоватьДляВсехРабочихМест
		|		ИЛИ ПрограммыОбученияСотрудниковПоОхранеТрудаРабочиеМеста.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|	И РабочиеМестаОхраныТруда.Владелец = &Организация";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Асинх Функция ФизическиеЛицаРабочиеМеста()
	
	ДанныеФизическиеЛица = Новый Массив; // Массив Из Структура
	Шаблон = НСтр("ru = '%1 увольняется с %2'");
	Кнопки = Новый СписокЗначений; // Массив Из КодВозвратаДиалога
	Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Добавить сотрудника в документ'"));
	Кнопки.Добавить(КодВозвратаДиалога.Пропустить);
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ПериодическиеОбучения.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ПериодическиеОбучения.ДанныеСтроки(ВыделеннаяСтрока);
		Если ЗначениеЗаполнено(ДанныеСтроки.ДатаУвольнения) Тогда
			ТекстВопроса = СтрШаблон(Шаблон,
				ДанныеСтроки.ФизическоеЛицо, Формат(ДанныеСтроки.ДатаУвольнения, НСтр("ru='ДФ=''dd.MM.yyyy ""г.""'''")));
			Результат = Ждать ВопросАсинх(ТекстВопроса, Кнопки); // КодВозвратаДиалога
			Если Результат <> КодВозвратаДиалога.ОК Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Описание = ОписаниеСтрокиОбучения();
		ЗаполнитьЗначенияСвойств(Описание, ДанныеСтроки);
		ДанныеФизическиеЛица.Добавить(Описание);
	КонецЦикла;
	
	Возврат ДанныеФизическиеЛица;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеСтрокиОбучения()
	
	Описание = Новый Структура;
	Описание.Вставить("ФизическоеЛицо");
	Описание.Вставить("РабочееМесто");
	Описание.Вставить("Обучение");
	Описание.Вставить("ДатаНачалаОбучения");
	Описание.Вставить("ДатаОкончанияОбучения");
	Описание.Вставить("Проверка");
	Описание.Вставить("ДатаСледующейПроверкиЗнания");
	
	Возврат Описание;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииСохраняемойНастройки()
	
	Настройки = СохраняемыеНастройки();
	Настройки.Организация = Организация;
	Настройки.Подразделение = Подразделение;
	СохранитьНастройкиНаСервере(Настройки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СохраняемыеНастройки()
	
	Настройки = Новый Структура;
	Настройки.Вставить("Организация");
	Настройки.Вставить("Подразделение");
	Возврат Настройки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Настройки)
	
	Для Каждого КлючИЗначение Из Настройки Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"ОбработкаОбучениеПоОхранеТруда",
			КлючИЗначение.Ключ,
			КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
